app/controllers/nfl_rushings_controller.rb

SELECT `nfl_rushings`.* FROM `nfl_rushings`
---
  def index
    @search = NflRushing.search(params[:q])